Repository: 18025341316/sql-parser
Catalog: locale/*/LC_MESSAGES/sqlparser.po
Languages: ro

source: Not implemented yet.
ro: Nu este inca implementat.

source: A new statement was found, but no delimiter between it and the previous one.
ro: O nouă operațiune a fost găsită, dar nu exista niciun delimitator între aceasta și cea anterioară.

source: Unrecognized alter operation.
ro: Operațiune de alterare necunoscută.

source: %1$d values were expected, but found %2$d.
ro: Au fost gasite %2$d valori desi erau asteptate %1$d.

source: An opening bracket followed by a set of values was expected.
ro: Erau de așteptat o paranteză deschisă urmată de o serie de valori.

source: An opening bracket was expected.
ro: O paranteza deschisa este necesara.

source: Unexpected keyword.
ro: Cuvinte cheie neașteptate.

source: Unexpected end of CASE expression
ro: Sirsit neasteptat al expresiei "CASE"

source: A symbol name was expected! A reserved keyword can not be used as a column name without backquotes.
ro: Un nume de simbol era de așteptat! Un cuvânt cheie rezervat nu poate fi utilizat ca nume de coloană daca nu este incadrat in ghilimele.

source: A symbol name was expected!
ro: Un nume de simbol era de așteptat!

source: A comma or a closing bracket was expected.
ro: Erau de așteptat o virgulă sau o paranteză închisă.

source: A closing bracket was expected.
ro: O paranteza inchisa este necesara.

source: Unrecognized data type.
ro: Tip de date nerecunoscut.

source: An alias was expected.
ro: Un alias era asteptat.

source: An alias was previously found.
ro: Un alias a fost deja gasit.

source: Unexpected dot.
ro: Caracterul punct(.) nu era asteptat.

source: An expression was expected.
ro: Era asteptata o expresie.

source: An offset was expected.
ro: O deplasare(offset) era asteptata.

source: This option conflicts with "%1$s".
ro: Aceasta optiune intra in conflict cu "%1$s".

source: The old name of the table was expected.
ro: Numele vechi al tabelului este cerut.

source: Keyword "TO" was expected.
ro: Cuvantul cheie "TO" este cerut.

source: The new name of the table was expected.
ro: Numele nou al tabelului este cerut.

source: A rename operation was expected.
ro: Este asteptata o operatiune de redenumire (rename).

source: Missing expression.
ro: Expresie lipsa.

source: Unexpected character.
ro: Caracter neasteptat.

source: Expected whitespace(s) before delimiter.
ro: Se cer spatii (whitespace) inainte de delimitator.

source: Expected delimiter.
ro: Se asteapta delimitator.

source: Variable name was expected.
ro: Numele variabilei era aşteptată.

source: Unexpected beginning of statement.
ro: Început neașteptat al declarației.

source: Unrecognized statement type.
ro: Tipul de declaraţie de nerecunoscut.

source: No transaction was previously started.
ro: Nici o tranzactie a fost început anterior.

source: This type of clause was previously parsed.
ro: Acest tip de clauză a fost analizat anterior.

source: Unrecognized keyword.
ro: Cuvânt cheie nerecunoscut.

source: A "RETURNS" keyword was expected.
ro: Un cuvânt cheie "RETURNS" era de aşteptat.

source: This type of clause is not valid in Multi-table queries.
ro: Acest tip de clauză nu este validă în interogări multi-tabel.
